MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15R/mcu.h
#define I2S0_TCSR                     (*((volatile uint32_t *)0x4002F000))      // SAI Transmit Control Register (I2S0_TCSR)
#define I2S0_TCR1                     (*((volatile uint32_t *)0x4002F004))      // SAI Transmit Configuration 1 Register (I2S0_TCR1)
#define I2S0_TCR2                     (*((volatile uint32_t *)0x4002F008))      // SAI Transmit Configuration 2 Register (I2S0_TCR2)
#define I2S0_TCR3                     (*((volatile uint32_t *)0x4002F00C))      // SAI Transmit Configuration 3 Register (I2S0_TCR3)
#define I2S0_TCR4                     (*((volatile uint32_t *)0x4002F010))      // SAI Transmit Configuration 4 Register (I2S0_TCR4)
#define I2S0_TCR5                     (*((volatile uint32_t *)0x4002F014))      // SAI Transmit Configuration 5 Register (I2S0_TCR5)
#define I2S0_TDR0                     (*((volatile uint32_t *)0x4002F020))      // SAI Transmit Data Register (I2S0_TDR0)
#define I2S0_TDR1                     (*((volatile uint32_t *)0x4002F024))      // SAI Transmit Data Register (I2S0_TDR1)
#define I2S0_TFR0                     (*((volatile uint32_t *)0x4002F040))      // SAI Transmit FIFO Register (I2S0_TFR0)
#define I2S0_TFR1                     (*((volatile uint32_t *)0x4002F044))      // SAI Transmit FIFO Register (I2S0_TFR1)
#define I2S0_TMR                      (*((volatile uint32_t *)0x4002F060))      // SAI Transmit Mask Register (I2S0_TMR)
#define I2S0_RCSR                     (*((volatile uint32_t *)0x4002F080))      // SAI Receive Control Register (I2S0_RCSR)
#define I2S0_RCR1                     (*((volatile uint32_t *)0x4002F084))      // SAI Receive Configuration 1 Register (I2S0_RCR1)
#define I2S0_RCR2                     (*((volatile uint32_t *)0x4002F088))      // SAI Receive Configuration 2 Register (I2S0_RCR2)
#define I2S0_RCR3                     (*((volatile uint32_t *)0x4002F08C))      // SAI Receive Configuration 3 Register (I2S0_RCR3)
#define I2S0_RCR4                     (*((volatile uint32_t *)0x4002F090))      // SAI Receive Configuration 4 Register (I2S0_RCR4)
#define I2S0_RCR5                     (*((volatile uint32_t *)0x4002F094))      // SAI Receive Configuration 5 Register (I2S0_RCR5)
#define I2S0_RDR0                     (*((volatile uint32_t *)0x4002F0A0))      // SAI Receive Data Register (I2S0_RDR0)
#define I2S0_RDR1                     (*((volatile uint32_t *)0x4002F0A4))      // SAI Receive Data Register (I2S0_RDR1)
#define I2S0_RFR0                     (*((volatile uint32_t *)0x4002F0C0))      // SAI Receive FIFO Register (I2S0_RFR0)
#define I2S0_RFR1                     (*((volatile uint32_t *)0x4002F0C4))      // SAI Receive FIFO Register (I2S0_RFR1)
#define I2S0_RMR                      (*((volatile uint32_t *)0x4002F0E0))      // SAI Receive Mask Register (I2S0_RMR)
#define I2S0_MCR                      (*((volatile uint32_t *)0x4002F100))      // SAI MCLK Control Register (I2S0_MCR)
#define I2S0_MDR                      (*((volatile uint32_t *)0x4002F104))      // SAI MCLK Divide Register (I2S0_MDR)
#define I2S1_TCSR                     (*((volatile uint32_t *)0x400AF000))      // SAI Transmit Control Register (I2S1_TCSR)
#define I2S1_TCR1                     (*((volatile uint32_t *)0x400AF004))      // SAI Transmit Configuration 1 Register (I2S1_TCR1)
#define I2S1_TCR2                     (*((volatile uint32_t *)0x400AF008))      // SAI Transmit Configuration 2 Register (I2S1_TCR2)
#define I2S1_TCR3                     (*((volatile uint32_t *)0x400AF00C))      // SAI Transmit Configuration 3 Register (I2S1_TCR3)
#define I2S1_TCR4                     (*((volatile uint32_t *)0x400AF010))      // SAI Transmit Configuration 4 Register (I2S1_TCR4)
#define I2S1_TCR5                     (*((volatile uint32_t *)0x400AF014))      // SAI Transmit Configuration 5 Register (I2S1_TCR5)
#define I2S1_TDR0                     (*((volatile uint32_t *)0x400AF020))      // SAI Transmit Data Register (I2S1_TDR0)
#define I2S1_TDR1                     (*((volatile uint32_t *)0x400AF024))      // SAI Transmit Data Register (I2S1_TDR1)
#define I2S1_TFR0                     (*((volatile uint32_t *)0x400AF040))      // SAI Transmit FIFO Register (I2S1_TFR0)
#define I2S1_TFR1                     (*((volatile uint32_t *)0x400AF044))      // SAI Transmit FIFO Register (I2S1_TFR1)
#define I2S1_TMR                      (*((volatile uint32_t *)0x400AF060))      // SAI Transmit Mask Register (I2S1_TMR)
#define I2S1_RCSR                     (*((volatile uint32_t *)0x400AF080))      // SAI Receive Control Register (I2S1_RCSR)
#define I2S1_RCR1                     (*((volatile uint32_t *)0x400AF084))      // SAI Receive Configuration 1 Register (I2S1_RCR1)
#define I2S1_RCR2                     (*((volatile uint32_t *)0x400AF088))      // SAI Receive Configuration 2 Register (I2S1_RCR2)
#define I2S1_RCR3                     (*((volatile uint32_t *)0x400AF08C))      // SAI Receive Configuration 3 Register (I2S1_RCR3)
#define I2S1_RCR4                     (*((volatile uint32_t *)0x400AF090))      // SAI Receive Configuration 4 Register (I2S1_RCR4)
#define I2S1_RCR5                     (*((volatile uint32_t *)0x400AF094))      // SAI Receive Configuration 5 Register (I2S1_RCR5)
#define I2S1_RDR0                     (*((volatile uint32_t *)0x400AF0A0))      // SAI Receive Data Register (I2S1_RDR0)
#define I2S1_RDR1                     (*((volatile uint32_t *)0x400AF0A4))      // SAI Receive Data Register (I2S1_RDR1)
#define I2S1_RFR0                     (*((volatile uint32_t *)0x400AF0C0))      // SAI Receive FIFO Register (I2S1_RFR0)
#define I2S1_RFR1                     (*((volatile uint32_t *)0x400AF0C4))      // SAI Receive FIFO Register (I2S1_RFR1)
#define I2S1_RMR                      (*((volatile uint32_t *)0x400AF0E0))      // SAI Receive Mask Register (I2S1_RMR)
#define I2S1_MCR                      (*((volatile uint32_t *)0x400AF100))      // SAI MCLK Control Register (I2S1_MCR)
#define I2S1_MDR                      (*((volatile uint32_t *)0x400AF104))      // SAI MCLK Divide Register (I2S1_MDR)


//*****************************************************************************
//
// Secured digital host controller (SDHC) registers
//
//*****************************************************************************

