MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15R/mcu.h
#define ADC0ALTTRGEN                  0x00000080      // ADC0 alternate trigger enable
#define ADC0PRETRGSEL                 0x00000010      // ADC0 pretrigger select
#define ADC0TRGSEL                    0x00000078      // ADC0 trigger select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT8 register.
//
//*****************************************************************************

#define FTM3OCH7SRC                   0x80000000      // FTM3 channel 7 output source
#define FTM3OCH6SRC                   0x40000000      // FTM3 channel 6 output source
#define FTM3OCH5SRC                   0x20000000      // FTM3 channel 5 output source
#define FTM3OCH4SRC                   0x10000000      // FTM3 channel 4 output source
#define FTM3OCH3SRC                   0x08000000      // FTM3 channel 3 output source
#define FTM3OCH2SRC                   0x04000000      // FTM3 channel 2 output source
#define FTM3OCH1SRC                   0x02000000      // FTM3 channel 1 output source
#define FTM3OCH0SRC                   0x01000000      // FTM3 channel 0 output source
#define FTM0OCH7SRC                   0x00800000      // FTM0 channel 7 output source
#define FTM0OCH6SRC                   0x00400000      // FTM0 channel 6 output source
#define FTM0OCH5SRC                   0x00200000      // FTM0 channel 5 output source
#define FTM0OCH4SRC                   0x00100000      // FTM0 channel 4 output source
#define FTM0OCH3SRC                   0x00080000      // FTM0 channel 3 output source
#define FTM0OCH2SRC                   0x00040000      // FTM0 channel 2 output source
#define FTM0OCH1SRC                   0x00020000      // FTM0 channel 1 output source
#define FTM0OCH0SRC                   0x00010000      // FTM0 channel 0 output source
#define FTM3SYNCBIT                   0x00000008      // FTM3 Hardware Trigger 0 Software Synchronization
#define FTM2SYNCBIT                   0x00000004      // FTM2 Hardware Trigger 0 Software Synchronization
#define FTM1SYNCBIT                   0x00000002      // FTM1 Hardware Trigger 0 Software Synchronization
#define FTM0SYNCBIT                   0x00000001      // FTM0 Hardware Trigger 0 Software Synchronization


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT9 register.
//
//*****************************************************************************

#define TPM2CLKSEL                    0x04000000      // TPM2 External Clock Pin Select
#define TPM1CLKSEL                    0x02000000      // TPM1 External Clock Pin Select
#define TPM2CH0SRC                    0x00600000      // TPM2 channel 0 input capture source select
#define TPM1CH0SRC                    0x00180000      // TPM1 channel 0 input capture source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SDID register.
//
//*****************************************************************************

#define FAMILYID                      0x780000000      // Kinetis Family ID
#define SUBFAMID                      0x78000000      // Kinetis Sub-Family ID
#define SERIESID                      0x07800000      // Kinetis Series ID
#define REVID                         0x00078000      // Device revision number
#define DIEID                         0x0000F800      // Device Die ID
#define FAMID                         0x000001C0      // Kinetis family identification
#define PINID                         0x00000078      // Pincount identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC1 register.
//
//*****************************************************************************

#define I2C3                          0x00000080      // I2C3 Clock Gate Control
#define I2C2                          0x00000040      // I2C2 Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC2 register.
//
//*****************************************************************************

#define FLEXIO                        0x80000000      // FlexIO Clock Gate Control
#define QSPI                          0x04000000      // QSPI Clock Gate Control
#define LPUART4                       0x00400000      // LPUART4 Clock Gate Control
#define DAC0                          0x00001000      // DAC0 Clock Gate Control
#define TPM2                          0x00000400      // TPM2 Clock Gate Control
#define TPM1                          0x00000200      // TPM1 Clock Gate Control
#define LPUART3                       0x00000080      // LPUART3 Clock Gate Control
#define LPUART2                       0x00000040      // LPUART2 Clock Gate Control
#define LPUART1                       0x00000020      // LPUART1 Clock Gate Control
#define LPUART0                       0x00000010      // LPUART0 Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC3 register.
//
//*****************************************************************************

#define FTM3                          0x02000000      // FTM3 Clock Gate Control
#define FTM2                          0x01000000      // FTM2 Clock Gate Control
#define SDHC                          0x00020000      // SDHC Clock Gate Control
#define I2S1                          0x00008000      // I2S1 Clock Gate Control
#define SPI3                          0x00002000      // SPI3 Clock Gate Control
#define SPI2                          0x00001000      // SPI2 Clock Gate Control
#define USBHSDCD                      0x00000008      // USBHS DCD Clock Gate Control
#define USBHSPHY                      0x00000004      // USBHS PHY Clock Gate Control
#define USBHS                         0x00000002      // USBHS Clock Gate Control
#define TRNG                          0x00000001      // TRNG Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC4 register.
//
//*****************************************************************************

#define VREF                          0x00100000      // VREF Clock Gate Control
#define CMP                           0x00080000      // Comparator Clock Gate Control
#define USBOTG                        0x00040000      // USB Clock Gate Control
#define I2C1                          0x00000080      // I2C1 Clock Gate Control
#define I2C0                          0x00000040      // I2C0 Clock Gate Control
#define CMT                           0x00000004      // CMT Clock Gate Control
#define EWM                           0x00000002      // EWM Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC5 register.
//
//*****************************************************************************

#define PORTE                         0x00002000      // Port E Clock Gate Control
#define PORTD                         0x00001000      // Port D Clock Gate Control
#define PORTC                         0x00000800      // Port C Clock Gate Control
#define PORTB                         0x00000400      // Port B Clock Gate Control
#define PORTA                         0x00000200      // Port A Clock Gate Control
#define LPTMR1                        0x00000010      // LPTMR1 Clock Gate Control
#define LPTMR0                        0x00000001      // LPTMR0 Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC6 register.
//
//*****************************************************************************

#define DAC0                          0x80000000      // DAC0 Clock Gate Control
#define RTC                           0x40000000      // RTC Access Control
#define ADC0                          0x08000000      // ADC0 Clock Gate Control
#define FTM2                          0x04000000      // FTM2 Clock Gate Control
#define FTM1                          0x02000000      // FTM1 Clock Gate Control
#define FTM0                          0x01000000      // FTM0 Clock Gate Control
#define PIT                           0x00800000      // PIT Clock Gate Control
#define PDB                           0x00400000      // PDB Clock Gate Control
#define USBDCD                        0x00200000      // USB DCD Clock Gate Control
#define CRC                           0x00040000      // CRC Clock Gate Control
#define I2S0                          0x00008000      // I2S0 Clock Gate Control
#define SPI1                          0x00002000      // SPI1 Clock Gate Control
#define SPI0                          0x00001000      // SPI0 Clock Gate Control
#define DMAMUX                        0x00000002      // DMA Mux Clock Gate Control
#define FTF                           0x00000001      // Flash Memory Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC7 register.
//
//*****************************************************************************

