MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15R/mcu.h
#define B1RWSC[3:0]                   0x780000000      // Bank 1 Read Wait State Control
#define                               0xFF8000000      // 
#define B1MW[1:0]                     0x000C0000      // Bank 1 Memory Width
#define                               0x00010000      // 
#define                               0x007F8000      // 
#define                               0x00000380      // 
#define B1DCE                         0x00000010      // Bank 1 Data Cache Enable
#define B1ICE                         0x00000008      // Bank 1 Instruction Cache Enable
#define B1DPE                         0x00000004      // Bank 1 Data Prefetch Enable
#define B1IPE                         0x00000002      // Bank 1 Instruction Prefetch Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW0Sn register.
//
//*****************************************************************************

#define tag[21:6]                     0x1FFFE00000      // 16-bit tag for cache entry
#define                               0x000003E0      // 
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW1Sn register.
//
//*****************************************************************************

#define tag[21:6]                     0x1FFFE00000      // 16-bit tag for cache entry
#define                               0x000003E0      // 
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW2Sn register.
//
//*****************************************************************************

#define tag[21:6]                     0x1FFFE00000      // 16-bit tag for cache entry
#define                               0x000003E0      // 
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_TAGVDW3Sn register.
//
//*****************************************************************************

#define tag[21:6]                     0x1FFFE00000      // 16-bit tag for cache entry
#define                               0x000003E0      // 
#define valid                         0x00000001      // 1-bit valid for cache entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnMU register.
//
//*****************************************************************************

#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW0SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnMU register.
//
//*****************************************************************************

#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW1SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry
#define data[31:0]                    0x80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry
#define data[127:96]                  0x80000000000000000000000000000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnMU register.
//
//*****************************************************************************

