MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15R/mcu.h
#define RESUME_STATUS                 0x00000400      // Indicates that the host is sending a wake-up after Suspend and has triggered an interrupt
#define OTGID_STATUS                  0x00000100      // Indicates the results of USB_ID pin on the USB cable plugged into the local Micro- or Mini-AB receptacle
#define DEVPLUGIN_STATUS              0x00000040      // Status indicator for non-standard resistive plugged-in detection
#define HOSTDISCONDETECT_STATUS       0x00000008      // Indicates at the local host (downstream) port that the remote device has disconnected while in High-Speed mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_DEBUGn register.
//
//*****************************************************************************

#define CLKGATE                       0x40000000      // Gate Test Clocks
#define HOST_RESUME_DEBUG             0x20000000      // Choose to trigger the host resume SE0 with HOST_FORCE_LS_SE0 = 0 or UTMI_SUSPEND = 1
#define SQUELCHRESETLENGTH            0xF0000000      // Duration of RESET in terms of the number of 480-MHz cycles
#define ENSQUELCHRESET                0x01000000      // Set bit to allow squelch to reset high-speed receive
#define SQUELCHRESETCOUNT             0x01F00000      // Delay in between the detection of squelch to the reset of high-speed RX
#define ENTX2RXCOUNT                  0x00001000      // Set this bit to allow a countdown to transition in between TX and RX
#define TX2RXCOUNT                    0x00007800      // Delay in between the end of transmit to the beginning of receive
#define ENHSTPULLDOWN                 0x00000060      // This bit field selects host pulldown overdrive mode
#define HSTPULLDOWN                   0x00000018      // This bit field selects whether to connect pulldown resistors on the USB_DP/USB_DM pins if the corresponding pulldown overdrive mode is enabled through USBPHY_DEBUG[5:4]
#define DEBUG_INTERFACE_HOLD          0x00000002      // Use holding registers to assist in timing for external UTMI interface
#define OTGIDPIOLOCK                  0x00000001      // Once OTG ID from USBPHY_STATUS_OTGID_STATUS is sampled, use this to hold the value


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_DEBUG0_STATUS register.
//
//*****************************************************************************

#define SQUELCH_COUNT                 0x1F80000000      // Running count of the squelch reset instead of normal end for HS RX
#define UTMI_RXERROR_FAIL_COUNT       0x7FE000000      // Running count of the UTMI_RXERROR
#define LOOP_BACK_FAIL_COUNT          0x7FFF8000      // Running count of the failed pseudo-random generator loopback


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_DEBUG1n register.
//
//*****************************************************************************

#define ENTAILADJVD                   0x0000C000      // Delay increment of the rise of squelch


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_VERSION register.
//
//*****************************************************************************

#define MAJOR                         0x7F80000000      // Fixed read-only value reflecting the MAJOR field of the RTL version
#define MINOR                         0x7F800000      // Fixed read-only value reflecting the MINOR field of the RTL version
#define STEP                          0x7FFF8000      // Fixed read-only value reflecting the stepping of the RTL version


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_PLL_SICn register.
//
//*****************************************************************************

#define PLL_LOCK                      0x80000000      // USB PLL lock status indicator
#define PLL_BYPASS                    0x00010000      // Bypass the USB PLL
#define PLL_ENABLE                    0x00002000      // Enable the clock output from the USB PLL
#define PLL_POWER                     0x00001000      // Power up the USB PLL
#define PLL_EN_USB_CLKS               0x00000040      // Enable the USB clock output from the USB PHY PLL
#define PLL_DIV_SEL                   0x00000070      // This field controls the USB PLL feedback loop divider


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_VBUS_DETECTn register.
//
//*****************************************************************************

#define Reserved                      0x1C0000000      // 
#define Reserved                      0x08000000      // 
#define DISCHARGE_VBUS                0x04000000      // Controls VBUS discharge resistor
#define Reserved                      0x0E000000      // 
#define Reserved                      0x00C00000      // 
#define PWRUP_CMPS                    0x00100000      // Enables the VBUS_VALID comparator
#define Reserved                      0x00080000      // 
#define VBUSVALID_TO_SESSVALID        0x00040000      // Selects the comparator used for VBUS_VALID
#define Reserved                      0x00FE0000      // 
#define VBUS_SOURCE_SEL               0x00000C00      // Selects the source of the VBUS_VALID signal reported to the USB controller
#define VBUSVALID_SEL                 0x00000100      // Selects the source of the VBUS_VALID signal reported to the USB controller
#define VBUSVALID_OVERRIDE            0x00000080      // Override value for VBUS_VALID signal sent to USB controller
#define AVALID_OVERRIDE               0x00000040      // Override value for A-Device Session Valid
#define BVALID_OVERRIDE               0x00000020      // Override value for B-Device Session Valid
#define SESSEND_OVERRIDE              0x00000010      // Override value for SESSEND
#define VBUS_OVERRIDE_EN              0x00000008      // VBUS detect signal override enable
#define VBUSVALID_THRESH              0x0000001C      // Sets the threshold for the VBUSVALID comparator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_VBUS_DET_STAT register.
//
//*****************************************************************************

